{
  "name": "ChangeMode",
  "enumeration": true,
  "shortdesc": "The destination color mode. Note: Color images must be changed to Grayscale mode before you can change them to Bitmap mode.",
  "elements": [
    {
      "type": "class",
      "property": [
        {
          "name": "GRAYSCALE",
          "rwaccess": "readonly",
          "shortdesc": "Grayscale.",
          "datatype": {
            "type": "int",
            "value": 1
          }
        },
        {
          "name": "RGB",
          "rwaccess": "readonly",
          "shortdesc": "RGB.",
          "datatype": {
            "type": "int",
            "value": 2
          }
        },
        {
          "name": "CMYK",
          "rwaccess": "readonly",
          "shortdesc": "CMYK.",
          "datatype": {
            "type": "int",
            "value": 3
          }
        },
        {
          "name": "LAB",
          "rwaccess": "readonly",
          "shortdesc": "Lab.",
          "datatype": {
            "type": "int",
            "value": 4
          }
        },
        {
          "name": "BITMAP",
          "rwaccess": "readonly",
          "shortdesc": "Bitmap. Note: Color images must be changed to Grayscale mode before you can change them to Bitmap mode.",
          "datatype": {
            "type": "int",
            "value": 5
          }
        },
        {
          "name": "INDEXEDCOLOR",
          "rwaccess": "readonly",
          "shortdesc": "Indexed color, in which the number of colors in the image is reduced to at most 256, the standard number of colors supported by the GIF and PNG-8 formats and many multimedia applications.",
          "description": "This conversion reduces file size by deleting color information from the image. To convert to indexed color, you must start with an image that is 8 bits per channel and in either Grayscale or RGB mode.",
          "datatype": {
            "type": "int",
            "value": 6
          }
        },
        {
          "name": "MULTICHANNEL",
          "rwaccess": "readonly",
          "shortdesc": "Image with multiple color channels.",
          "description": "Uses 256 levels of gray in each channel. Useful for specialized printing. Color channels in the original image become spot color channels in the converted image. A CMYK image converted to Multichannel mode creates cyan, magenta, yellow, and black spot channels. An RGB image converted Multichannel mode creates cyan, magenta, and yellow spot channels. The new grayscale information is based on the color values of the pixels in each channel. Multichannel mode images can be saved in Photoshop, Photoshop 2.0, Photoshop Raw, or Photoshop DCS 2.0 format. To export a multichannel image, save it in Photoshop DCS 2.0 format.",
          "datatype": {
            "type": "int",
            "value": 7
          }
        }
      ]
    }
  ]
}