{
  "name": "Palette",
  "enumeration": true,
  "shortdesc": "The palette type for converting an image to indexed color.",
  "elements": [
    {
      "type": "class",
      "property": [
        {
          "name": "EXACT",
          "rwaccess": "readonly",
          "shortdesc": "The palette uses the exact colors appearing in the RGB image; available only if the image uses 256 or fewer colors.",
          "description": "Because the image's palette contains all colors in the image, there is no dithering.",
          "datatype": {
            "type": "int",
            "value": 1
          }
        },
        {
          "name": "MACOSPALETTE",
          "rwaccess": "readonly",
          "shortdesc": "The Mac OS default 8-bit palette, whch is based on a uniform sampling of RGB colors.",
          "datatype": {
            "type": "int",
            "value": 2
          }
        },
        {
          "name": "WINDOWSPALETTE",
          "rwaccess": "readonly",
          "shortdesc": "The Windows system's default 8-bit palette, whch is based on a uniform sampling of RGB colors.",
          "datatype": {
            "type": "int",
            "value": 3
          }
        },
        {
          "name": "WEBPALETTE",
          "rwaccess": "readonly",
          "shortdesc": "The 216-color palette that web browsers, regardless of platform, use to display images on a monitor limited to 256 colors.",
          "description": "A subset of the Mac OS 8-bit palette. Use this option to avoid browser dither when viewing images on a monitor display limited to 256 colors.",
          "datatype": {
            "type": "int",
            "value": 4
          }
        },
        {
          "name": "UNIFORM",
          "rwaccess": "readonly",
          "shortdesc": "Creates a palette by uniformly sampling colors from the RGB color cube.",
          "description": "For example, if Photoshop takes six evenly spaced color levels each of red, green, and blue, the combination produces a uniform palette of 216 colors (6 cubed = 6 x 6 x 6 = 216). The total number of colors displayed in an image corresponds to the nearest perfect cube (8, 27, 64, 125, or 216) that is less than the value in the Colors text box.",
          "datatype": {
            "type": "int",
            "value": 5
          }
        },
        {
          "name": "LOCALPERCEPTUAL",
          "rwaccess": "readonly",
          "shortdesc": "Creates a custom palette by giving priority to colors for in the image which the human eye has greater sensitivity.",
          "datatype": {
            "type": "int",
            "value": 6
          }
        },
        {
          "name": "LOCALSELECTIVE",
          "rwaccess": "readonly",
          "shortdesc": "Creates a color table similar to the Perceptual color table, but favoring broad areas of color in the image and the preservation of web colors.",
          "description": "Usually produces images with the greatest color integrity.",
          "datatype": {
            "type": "int",
            "value": 7
          }
        },
        {
          "name": "LOCALADAPTIVE",
          "rwaccess": "readonly",
          "shortdesc": "Creates a palette by sampling the colors from the spectrum appearing most commonly in the image.",
          "description": "For example, an RGB image with only the colors green and blue produces a palette made primarily of greens and blues.",
          "datatype": {
            "type": "int",
            "value": 8
          }
        },
        {
          "name": "MASTERPERCEPTUAL",
          "rwaccess": "readonly",
          "shortdesc": "Creates a custom palette by giving priority to colors in a group of open images with the same color palette for which the human eye has greater sensitivity.",
          "datatype": {
            "type": "int",
            "value": 9
          }
        },
        {
          "name": "MASTERSELECTIVE",
          "rwaccess": "readonly",
          "shortdesc": "Creates a color table similar to the Master Perceptual color table, but favoring broad areas of color and the preservation of web colors.",
          "datatype": {
            "type": "int",
            "value": 10
          }
        },
        {
          "name": "MASTERADAPTIVE",
          "rwaccess": "readonly",
          "shortdesc": "Creates a palette by sampling the colors from the spectrum appearing most commonly in a group of open images that share the same color palette.",
          "datatype": {
            "type": "int",
            "value": 11
          }
        },
        {
          "name": "PREVIOUSPALETTE",
          "rwaccess": "readonly",
          "shortdesc": "Uses the custom palette from the previous conversion, making it easy to convert several images with the same custom palette.",
          "datatype": {
            "type": "int",
            "value": 12
          }
        }
      ]
    }
  ]
}