{
    "name": "Window",
    "dynamic": true,
    "elements": {
        "class": {
            "properties": [
                {
                    "name": "frameworkName",
                    "readonly": true,
                    "type": "String",
                    "array": false,
                    "description": "\n            Deprecated. Use ScriptUI.frameworkName instead.\n          "
                },
                {
                    "name": "version",
                    "readonly": true,
                    "type": "Mixed",
                    "array": false,
                    "description": "\n            Deprecated. Use ScriptUI.version instead.\n          "
                }
            ],
            "methods": [
                {
                    "name": "find",
                    "parameters": [
                        {
                            "name": "type",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "The name of a predefined resource available to JavaScript in the current application; or the window type. ",
                            "longdesc": "If a title is specified, the type is used if more than one window with that title is found. Can be null or the empty string. "
                        },
                        {
                            "name": "title",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "The window title."
                        }
                    ],
                    "description": "Use this method to find an existing window. ",
                    "longdesc": "\n            This includes windows defined by ScriptUI resource strings, windows already created by a script, and windows created by the application (if the application supports this case). This function is not supported by all applications. Returns a Window object found or generated from the resource, or null if no such window or resource exists.\n          ",
                    "type": "Window",
                    "array": false
                },
                {
                    "name": "alert",
                    "parameters": [
                        {
                            "name": "message",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "TThe string for the displayed message."
                        },
                        {
                            "name": "title",
                            "type": "String",
                            "array": false,
                            "optional": true,
                            "description": "A string to appear as the title of the dialog, if the platform supports a title. ",
                            "longdesc": "Ignored in Mac OS, which does not support titles for alert dialogs. The default title string is \"Script Alert\"."
                        },
                        {
                            "name": "errorIcon",
                            "type": "Boolean",
                            "array": false,
                            "optional": false,
                            "description": "When true, the platform-standard alert icon is replaced by the platform-standard error icon in the dialog. ",
                            "longdesc": "Ignored in Mac OS, which does not support icons for alert dialogs. ",
                            "value": "false"
                        }
                    ],
                    "description": "Displays a platform-standard dialog containing a short message and an OK button."
                },
                {
                    "name": "confirm",
                    "parameters": [
                        {
                            "name": "message",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "The string for the displayed message."
                        },
                        {
                            "name": "noAsDefault",
                            "type": "Boolean",
                            "array": false,
                            "optional": false,
                            "description": "When true, the No button is the default choice, selected when the user types Enter. ",
                            "longdesc": "Default is false, meaning that Yes is the default choice. ",
                            "value": "false"
                        },
                        {
                            "name": "title",
                            "type": "String",
                            "array": false,
                            "optional": true,
                            "description": "A string to appear as the title of the dialog, if the platform supports a title. ",
                            "longdesc": "Ignored in Mac OS, which does not support titles for alert dialogs. The default title string is \"Script Alert\"."
                        }
                    ],
                    "description": "Displays a platform-standard dialog containing a short message and two buttons labeled Yes and No.",
                    "longdesc": "Returns true if the user clicked Yes, false if the user clicked No.",
                    "type": "Boolean",
                    "array": false
                },
                {
                    "name": "prompt",
                    "parameters": [
                        {
                            "name": "prompt",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "The string for the displayed message."
                        },
                        {
                            "name": "default",
                            "type": "String",
                            "array": false,
                            "optional": true,
                            "description": "The initial value to be displayed in the text edit field."
                        },
                        {
                            "name": "title",
                            "type": "String",
                            "array": false,
                            "optional": true,
                            "description": "A string to appear as the title of the dialog. ",
                            "longdesc": "In Windows, this appears in the window’s frame; in Mac OS it appears above the message. The default title string is \"Script Prompt\"."
                        }
                    ],
                    "description": "Displays a modal dialog that returns the user’s text input.",
                    "longdesc": "Returns the value of the text edit field if the user clicked OK, null if the user clicked Cancel.",
                    "type": "String",
                    "array": false
                }
            ]
        },
        "constructors": {
            "methods": [
                {
                    "name": "Window",
                    "parameters": [
                        {
                            "name": "type",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "The window type.  ",
                            "longdesc": "\n                One of:\n                \n                  \n                    window: Creates a simple window that can be used as a main window for an application. (Not supported by Photoshop CS3.)\n                  \n                  \n                    palette: Creates a modeless dialog, also called a floating palette. (Not supported by Photoshop CS3.)\n                  \n                  \n                    dialog: Creates a modal dialog.\n                  \n                \n                This argument can also be a ScriptUI resource specification; in that case, all other arguments are ignored.\n              "
                        },
                        {
                            "name": "title",
                            "type": "String",
                            "array": false,
                            "optional": true,
                            "description": "The window title, a localizable string."
                        },
                        {
                            "name": "bounds",
                            "type": "Bounds",
                            "array": false,
                            "optional": true,
                            "description": "The window's position and size."
                        },
                        {
                            "name": "properties",
                            "type": "Object",
                            "array": false,
                            "optional": true,
                            "description": "An object containing creation-only properties.",
                            "longdesc": "\n                Can contain any of these properties:\n                \n                  \n                    resizeable: When true, the window can be resized by the user. Default is false.\n                  \n                  \n                    su1PanelCoordinates: Photoshop only. When true, the child panels of this window automatically adjust the positions of their children for compatability with Photoshop CS (in which the vertical coordinate was measured from outside the frame). Default is false. Individual panels can override the parent window’s setting.\n                  \n                  \n                    closeButton:  When true, the title bar includes a button to close the window, if the platform and window type allow it. When false, it does not. Default is true. Not used for dialogs.\n                  \n                  \n                    maximizeButton:  When true, the title bar includes a button to expand the window to its maximum size (typically, the entire screen), if the platform and window type allow it. When false, it does not. Default is false for type palette, true for type window. Not used for dialogs.\n                  \n                  \n                    minimizeButton: When true, the title bar includes a button to minimize or iconify the window, if the platform and window type allow it. When false, it does not. Default is false for type palette, true for type window. Main windows cannot have a minimize button in Mac OS. Not used for dialogs.\n                  \n                  \n                    independent:  When true, a window of type window is independent of other application windows, and can be hidden behind them in Windows. In Mac OS, has no effect. Default is false.\n                  \n                  \n                    borderless:  When true, the window has no title bar or borders. Properties that control those features are ignored.\n                  \n                \n              "
                        }
                    ],
                    "description": "Creates a new window."
                }
            ]
        },
        "instance": {
            "properties": [
                {
                    "name": "graphics",
                    "readonly": true,
                    "type": "ScriptUIGraphics",
                    "array": false,
                    "description": "\n            The graphics object that can be used to customize the window’s appearance, in response to the onDraw event.\n          "
                },
                {
                    "name": "visible",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "When true, the element is shown, when false it is hidden.",
                    "longdesc": "When a container is hidden, its children are also hidden, but they retain their own visibility values, and are shown or hidden accordingly when the parent is next shown."
                },
                {
                    "name": "bounds",
                    "readonly": false,
                    "type": "Bounds",
                    "array": false,
                    "description": "The bounds of the window's drawable area, excluding the frame, in screen coordinates."
                },
                {
                    "name": "frameBounds",
                    "readonly": true,
                    "type": "Bounds",
                    "array": false,
                    "description": "The bounds of the window frame in screen coordinates.",
                    "longdesc": " The frame consists of the title bar and borders that enclose the content region of a window, depending on the windowing system. "
                },
                {
                    "name": "frameLocation",
                    "readonly": false,
                    "type": "Point",
                    "array": false,
                    "description": "The top left corner of the window frame in screen coordinates.",
                    "longdesc": "\n            The same as [frameBounds.x, frameBounds.y]. Set this value to move the window frame to the specified location on the screen. The frameBounds value changes accordingly.\n          "
                },
                {
                    "name": "frameSize",
                    "readonly": true,
                    "type": "Dimension",
                    "array": false,
                    "description": "The size and location of the window's frame in screen coordinates."
                },
                {
                    "name": "location",
                    "readonly": false,
                    "type": "Point",
                    "array": false,
                    "description": "The upper left corner of the window's drawable area.",
                    "longdesc": "The same as [bounds.x, bounds.y]. "
                },
                {
                    "name": "maximumSize",
                    "readonly": false,
                    "type": "Dimension",
                    "array": false,
                    "description": "The largest rectangle to which the window can be resized."
                },
                {
                    "name": "minimumSize",
                    "readonly": false,
                    "type": "Dimension",
                    "array": false,
                    "description": "The smallest rectangle to which the window can be resized."
                },
                {
                    "name": "preferredSize",
                    "readonly": false,
                    "type": "Dimension",
                    "array": false,
                    "description": "The preferred size of the window.",
                    "longdesc": "Used in automatic layout and resizing. To set a specific value for only one dimension, specify the other dimension as -1. "
                },
                {
                    "name": "size",
                    "readonly": false,
                    "type": "Dimension",
                    "array": false,
                    "description": "The current size and location of the content area of the window in screen coordinates."
                },
                {
                    "name": "windowBounds",
                    "readonly": true,
                    "type": "Bounds",
                    "array": false,
                    "description": "The bounds of this window relative to the top-level parent window."
                },
                {
                    "name": "characters",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "A number of characters for which to reserve space when calculating the preferred size of the window. "
                },
                {
                    "name": "justify",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The default text justification style for child text elements. ",
                    "longdesc": "\n            One of left, center, or right. Justification only works if this value is set on creation of the element.\n          ",
                    "value": "left"
                },
                {
                    "name": "text",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The title, label, or displayed text, a localizeable string.",
                    "longdesc": "Does not apply to containers of type group."
                },
                {
                    "name": "active",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "Set to true to make this window active. ",
                    "longdesc": "\n            A modal dialog that is visible is by definition the active dialog.\n            An active palette is the front-most window.\n            \n              An active control is the one with focus—that is, the one that accepts keystrokes, or in the case of a Button, be selected when the user types  Return or Enter.\n            \n          "
                },
                {
                    "name": "shortcutKey",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "\n            The keypress combination that invokes this element's onShortcutKey() callback.\n          "
                },
                {
                    "name": "cancelElement",
                    "readonly": false,
                    "type": "Object",
                    "array": false,
                    "description": "\n            For windows of type dialog, the UI element to notify when the user presses a cancellation key combination.\n          ",
                    "longdesc": "The cancellation key is the Esc key. By default, looks for a button whose name or text is \"cancel\" (case disregarded)."
                },
                {
                    "name": "defaultElement",
                    "readonly": false,
                    "type": "Object",
                    "array": false,
                    "description": "\n            For windows of type dialog, the UI element to notify when the user presses a Enter key.\n          ",
                    "longdesc": "By default, looks for a button whose name or text is \"ok\" (case disregarded)."
                },
                {
                    "name": "maximized",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "True if the window is expanded."
                },
                {
                    "name": "minimized",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "True if the window is minimized or iconified."
                },
                {
                    "name": "alignChildren",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "Tells the layout manager how unlike-sized children of this container should be aligned within a column or row. ",
                    "longdesc": "\n            Order of creation determines which children are at the top of a column or the left of a row; the earlier a child is created, the closer it is to the top or left of its column or row. If defined, alignment for a child element overrides the alignChildren setting for the parent container. See alignment property for values.\n          "
                },
                {
                    "name": "children",
                    "readonly": true,
                    "type": "Object",
                    "array": true,
                    "description": "The collection of UI elements that have been added to this container.",
                    "longdesc": "An array indexed by number or by a string containing an element's name. The length property of this array is the number of child elements for container elements, and is zero for controls."
                },
                {
                    "name": "layout",
                    "readonly": false,
                    "type": "LayoutManager",
                    "array": false,
                    "description": "The layout manager for this container.",
                    "longdesc": "\n            The first time a container object is made visible, ScriptUI invokes this layout manager by calling its layout() function. Default is an instance of the LayoutManager class that is automatically created when the container element is created.\n          "
                },
                {
                    "name": "margins",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "The number of pixels between the edges of a container and the outermost child elements.",
                    "longdesc": " You can specify different margins for each edge of the container. The default value is based on the type of container, and is chosen to match the standard Adobe UI guidelines. "
                },
                {
                    "name": "orientation",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The layout orientation of children in a container.",
                    "longdesc": "\n            Interpreted by the layout manager for the container. The default LayoutManager  Object accepts the (case-insensitive) values row, column, or stack.  For window and panel, the default is column, and for group the default is row. The allowed values for the container’s alignChildren and its children’s alignment properties depend on the orientation.\n          "
                },
                {
                    "name": "spacing",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "The number of pixels separating one child element from its adjacent sibling element.",
                    "longdesc": "Because each container holds only a single row or column of children, only a single spacing value is needed for a container. The default value is based on the type of container, and is chosen to match standard Adobe UI guidelines. "
                },
                {
                    "name": "alignment",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "\n            The alignment style for child elements of a container. If defined, this value overrides the alignChildren setting for the parent container.\n          ",
                    "longdesc": "\n            This can be a single string, which indicates the alignment for the orientation specified in the parent container, or an array of two strings, indicating both the horizontal and vertical alignment (in that order). Allowed values depend on the orientation value of the parent container. They are not case sensitive.\n            \n              For orientation=row:top, bottom, fill\n            \n            \n              For orientation=column: left, right, fill\n            \n            \n              For orientation=stack:top, bottom, left, right, fill\n            \n          "
                },
                {
                    "name": "properties",
                    "readonly": false,
                    "type": "Object",
                    "array": false,
                    "description": "An object that contains one or more creation properties of the container (properties used only when the element is created). ",
                    "longdesc": "\n            Creation properties of a Window object can include:\n            resizeable: When true, the window can be resized by the user. Default is false.\n            su1PanelCoordinates: Photoshop only. When true, the child panels of this window automatically adjust the positions of their children for compatability with Photoshop CS (in which the vertical coordinate was measured from outside the frame). Default is false. Individual panels can override the parent window’s setting.\n            closeButton: Bridge only. When true, the title bar includes a button to close the window, if the platform and window type allow it. When false, it does not. Default is true. Not used for dialogs. \n            maximizeButton: Bridge only. When true, the title bar includes a button to expand the window to its maximum size (typically, the entire screen), if the platform and window type allow it. When false, it does not. Default is false for type palette, true for type window. Not used for dialogs.\n          "
                },
                {
                    "name": "enabled",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "True if this element is enabled.",
                    "longdesc": "An enabled element can accept input, according to its type. When false, control elements do not accept input, and all types of elements have a dimmed appearance. "
                },
                {
                    "name": "helpTip",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The help text that is displayed when the mouse hovers over the element."
                },
                {
                    "name": "indent",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "The number of pixels to indent the element."
                },
                {
                    "name": "parent",
                    "readonly": true,
                    "type": "Object",
                    "array": false,
                    "description": "The immediate parent element."
                },
                {
                    "name": "window",
                    "readonly": true,
                    "type": "Window",
                    "array": false,
                    "description": "The window that this element belongs to."
                },
                {
                    "name": "type",
                    "readonly": true,
                    "type": "String",
                    "array": false,
                    "description": "The element type; \"dialog\", \"palette\", or \"window\"."
                },
                {
                    "name": "opacity",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "The opacity of the window, in the range [0..1]. ",
                    "longdesc": "A value of 1.0 (the default) makes the window completely opaque, a value of 0 makes it completely transparent. Intermediate values make it partially transparent to any degree.",
                    "value": "1.0"
                }
            ],
            "methods": [
                {
                    "name": "show",
                    "parameters": [],
                    "description": "Makes this window visible.",
                    "longdesc": "\n            If an onShow() callback is defined for a window, calls that function before showing the window.When a window or container is hidden, its children are also hidden, but when it is shown again, the children retain their own visibility states. For a modal dialog, opens the dialog and does not return until the dialog is dismissed. If it is dismissed via the close() method, this method returns any result value passed to that method. Otherwise, returns 0.\n          "
                },
                {
                    "name": "hide",
                    "parameters": [],
                    "description": "Hides this windows.",
                    "longdesc": "\n            When a window is hidden, its children are also hidden, but when it is shown again, the children retain their own visibility states. For a modal dialog, closes the dialog and sets its result to 0.\n          "
                },
                {
                    "name": "notify",
                    "parameters": [
                        {
                            "name": "eventName",
                            "type": "String",
                            "array": false,
                            "optional": true,
                            "description": "The event name; if omitted, the default event is sent.",
                            "longdesc": "\n                One of: onClose, onMove, onMoving, onResize, onResizing, onShow\n              "
                        }
                    ],
                    "description": "Sends a notification message to all listeners, simulating the specified user interaction event."
                },
                {
                    "name": "center",
                    "parameters": [
                        {
                            "name": "window",
                            "type": "Window",
                            "array": false,
                            "optional": true,
                            "description": "The relative window. If not specified, centers on the screen. "
                        }
                    ],
                    "description": "Centers this window on screen or with repect to another window."
                },
                {
                    "name": "close",
                    "parameters": [
                        {
                            "name": "return",
                            "type": "Mixed",
                            "array": false,
                            "optional": true,
                            "description": "A number to be returned from the show() method that invoked this window as a modal dialog."
                        }
                    ],
                    "description": "Closes this window.",
                    "longdesc": "\n            . If an onClose() callback is defined for the window, calls that function before closing the window.\n          "
                },
                {
                    "name": "add",
                    "parameters": [
                        {
                            "name": "type",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "\n                The type of the child element, as specified for the type property.\n              ",
                            "longdesc": "\n                Control types are listed in the JavaScript Tools Guide.\n              "
                        },
                        {
                            "name": "bounds",
                            "type": "Bounds",
                            "array": false,
                            "optional": true,
                            "description": "A bounds specification that describes the size and position of the new control or container, relative to its parent. ",
                            "longdesc": "\n                If supplied, this value creates a new Bounds object which is assigned to the new object’s bounds property.\n              "
                        },
                        {
                            "name": "text",
                            "type": "String",
                            "array": false,
                            "optional": true,
                            "description": "The text or label, a localizable string.",
                            "longdesc": "\n                Initial text to be displayed in the control as the title, label, or contents, depending on the control type. If supplied, this value is assigned to the new object’s text property.\n              "
                        },
                        {
                            "name": "properties",
                            "type": "Object",
                            "array": false,
                            "optional": true,
                            "description": "An object that contains one or more creation properties of the new child (properties used only when the element is created). ",
                            "longdesc": "\n                The creation properties depend on the element type. See properties property of each control type.\n              "
                        }
                    ],
                    "description": "Creates and returns a new control or container object and adds it to the children of this window. ",
                    "type": "Object",
                    "array": false
                },
                {
                    "name": "remove",
                    "parameters": [
                        {
                            "name": "what",
                            "type": "Mixed",
                            "array": false,
                            "optional": false,
                            "description": "\n                The child control to remove, specified by 0-based index, text property value, or as a control object.\n              "
                        }
                    ],
                    "description": "\n            Removes the specified child control from this window’s children array.\n          ",
                    "longdesc": " No error results if the child does not exist. "
                },
                {
                    "name": "addEventListener",
                    "parameters": [
                        {
                            "name": "eventName",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "The name of the event.",
                            "longdesc": "Predefined event names are: change, changing, move, moving, resize, resizing, show , enterKey, focus, blur, keydown, keyup, mousedown, mouseup, mousemove, mouseover, mouseout, click (detail = 1 for single, 2 for double)."
                        },
                        {
                            "name": "handler",
                            "type": "Function",
                            "array": false,
                            "optional": false,
                            "description": "The function that handles the event.",
                            "longdesc": "\n                This can be the name of a function defined in the extension, or a locally defined handler function to be executed when the event occurs. A handler function takes one argument, the UIEvent object.\n              "
                        },
                        {
                            "name": "capturePhase",
                            "type": "Boolean",
                            "array": false,
                            "optional": true,
                            "description": "When true, the handler is called only in the capturing phase of the event propagation. ",
                            "longdesc": "Default is false, meaning that the handler is called in the bubbling phase if this object is an ancestor of the target, or in the at-target phase if this object is itself the target.",
                            "value": "false"
                        }
                    ],
                    "description": "Registers an event handler for a particular type of event occuring in this window.",
                    "type": "Boolean",
                    "array": false
                },
                {
                    "name": "removeEventListener",
                    "parameters": [
                        {
                            "name": "eventName",
                            "type": "String",
                            "array": false,
                            "optional": false,
                            "description": "The name of the event."
                        },
                        {
                            "name": "handler",
                            "type": "Function",
                            "array": false,
                            "optional": false,
                            "description": "The function that handles the event."
                        },
                        {
                            "name": "capturePhase",
                            "type": "Boolean",
                            "array": false,
                            "optional": false,
                            "description": "Whether to call the handler only in the capturing phase of the event propagation.",
                            "value": "false"
                        }
                    ],
                    "description": "Unregisters an event handler for a particular type of event occuring in this window.",
                    "longdesc": " All arguments must be identical to those that were used to register the event handler.",
                    "type": "Boolean",
                    "array": false
                },
                {
                    "name": "dispatchEvent",
                    "parameters": [],
                    "description": "Simulates the occurrence of an event in this target. ",
                    "longdesc": "\n            A script can create a UIEvent object for a specific event and pass it to this method to start the event propagation for the event.\n          ",
                    "type": "UIEvent",
                    "array": false
                }
            ]
        }
    },
    "description": "The instance represents a top-level window or dialog box, which contains user-interface elements.",
    "longdesc": "\n        The globally available Window object provides access to predefined and script-defined windows.\n      "
}