{
    "name": "BlendMode",
    "dynamic": false,
    "elements": {
        "class": {
            "properties": [
                {
                    "name": "NORMAL",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Colors the object with the blend color, without interaction with the base color.",
                    "value": "1852797549"
                },
                {
                    "name": "MULTIPLY",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Multiplies the base color by the blend color, resulting in a darker color. Note: Multiplying with black produces black; multiplying with white leaves the color unchanged.",
                    "value": "2020625762"
                },
                {
                    "name": "SCREEN",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Multiplies the inverse of the blend and base colors, resulting in a lighter color. Note: Screening with white produces white; screening with black leaves the color unchanged.",
                    "value": "2020625763"
                },
                {
                    "name": "OVERLAY",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Multiplies or screens the colors, depending on the base color; patterns or colors overlay the existing artwork, preserving base color highlights and shadows while mixing in the blend color to reflect the lightness or darkness of the original color.",
                    "value": "2020625764"
                },
                {
                    "name": "SOFT_LIGHT",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "For blend colors lighter than 50% gray, lightens the artwork as if it were dodged; for blend colors darker than 50% gray, darkens the artwork as if it were burned. Note: Painting with pure black or white produces a distinctly darker or lighter area, but does not result in pure black or white.",
                    "value": "2020625765"
                },
                {
                    "name": "HARD_LIGHT",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "For blend colors lighter than 50% gray, lightens the artwork as if it were screened; for blend colors darker than 50% gray, darkens the artwork as if it were multiplied. Note: Painting with pure black or white results in pure black or white.",
                    "value": "2020625766"
                },
                {
                    "name": "COLOR_DODGE",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Brightens the base color to reflect the blend color. Note: Blending with pure black produces no change.",
                    "value": "2020625767"
                },
                {
                    "name": "COLOR_BURN",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Darkens the base color to reflect the blend color. Note: Blending with white produces no change.",
                    "value": "2020625768"
                },
                {
                    "name": "DARKEN",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Selects the darker of the base or blend colors as the resulting color; replaces areas lighter than the blend color but does not change areas darker than the blend color.",
                    "value": "2020625769"
                },
                {
                    "name": "LIGHTEN",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Selects the lighter of the base or blend colors as the resulting color; replaces areas darker than the blend color but does not change areas lighter than the blend color",
                    "value": "2020625770"
                },
                {
                    "name": "DIFFERENCE",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Subtracts either the blend color from the base color or vice versa, depending on which has the greater brightness value. Note: Blending with white inverts the base color values; blending with black produces no change.",
                    "value": "2020625771"
                },
                {
                    "name": "EXCLUSION",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Creates an effect similar to--but lower in contrast than--the difference blend mode. Note: Blending with white inverts the base color values; blending with black produces no change",
                    "value": "2020625772"
                },
                {
                    "name": "HUE",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Creates a color with the luminance and saturation of the base color and the hue of the blend color.",
                    "value": "2020625773"
                },
                {
                    "name": "SATURATION",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Creates a color with the luminance and hue of the base color and the saturation of the blend color. Note: Does not change areas with no saturation (0% gray).",
                    "value": "1380545377"
                },
                {
                    "name": "COLOR",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Creates a color with the luminance of the base color and the hue and saturation of the blend color. Note: Preserves gray levels and is useful for coloring monochrome images or tinting color images. Creates the inverse effect of the luminosity blend mode.",
                    "value": "1668246642"
                },
                {
                    "name": "LUMINOSITY",
                    "readonly": true,
                    "type": "Number",
                    "array": false,
                    "description": "Creates a color with the hue and saturation of the base color and the luminance of the blend color. Note: Creates the inverse effect of the color blend mode.",
                    "value": "2020625776"
                }
            ],
            "methods": []
        },
        "constructors": {
            "methods": []
        },
        "instance": {
            "properties": [],
            "methods": []
        }
    },
    "description": "Blend mode options."
}