{
  "name": "CellStyle",
  "dynamic": true,
  "shortdesc": "A cell style.",
  "elements": [
    {
      "type": "instance",
      "property": [
        {
          "name": "id",
          "rwaccess": "readonly",
          "shortdesc": "The unique ID of the CellStyle.",
          "datatype": {
            "type": "Number"
          }
        },
        {
          "name": "isValid",
          "rwaccess": "readonly",
          "shortdesc": "Returns true if the object specifier resolves to valid objects.",
          "datatype": {
            "type": "Boolean"
          }
        },
        {
          "name": "parent",
          "rwaccess": "readonly",
          "shortdesc": "The parent of the CellStyle (a Document, Application or CellStyleGroup).",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "index",
          "rwaccess": "readonly",
          "shortdesc": "The index of the CellStyle within its containing object.",
          "datatype": {
            "type": "Number"
          }
        },
        {
          "name": "events",
          "rwaccess": "readonly",
          "shortdesc": "A collection of events.",
          "datatype": {
            "type": "Events"
          }
        },
        {
          "name": "eventListeners",
          "rwaccess": "readonly",
          "shortdesc": "A collection of event listeners.",
          "datatype": {
            "type": "EventListeners"
          }
        },
        {
          "name": "basedOn",
          "shortdesc": "The style that this style is based on. Can return: CellStyle or String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "appliedParagraphStyle",
          "shortdesc": "The paragraph style applied to the text. Can return: ParagraphStyle or NothingEnum enumerator. Can also accept: String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "gradientFillLength",
          "shortdesc": "The length (of a linear gradient) or radius (of a radial gradient) applied to the fill of the object. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "gradientFillAngle",
          "shortdesc": "The angle of a linear gradient applied to the fill of the object. (Range: -180 to 180). Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "gradientFillStart",
          "shortdesc": "The starting point (in page coordinates) of a gradient applied to the fill of the CellStyle, in the format [x, y]. Can return: Array of 2 Units or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topInset",
          "shortdesc": "The top inset of the cell. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftInset",
          "shortdesc": "The left inset of the cell. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomInset",
          "shortdesc": "The bottom inset of the cell. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightInset",
          "shortdesc": "The right inset of the cell. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "fillColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the fill of the object. Can return: Swatch or NothingEnum enumerator. Can also accept: String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "fillTint",
          "shortdesc": "The tint (as a percentage) of the fill of the object. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "overprintFill",
          "shortdesc": "If true, the fill of the object will overprint. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topLeftDiagonalLine",
          "shortdesc": "If true, draws a diagonal line starting from the top left. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topRightDiagonalLine",
          "shortdesc": "If true, draws a diagonal line starting from the top right. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineInFront",
          "shortdesc": "If true, draws the diagonal line in front of cell contents. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeWeight",
          "shortdesc": "The diagonal line stroke weight. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeType",
          "shortdesc": "The stroke type of the diagonal line(s). Can return: StrokeStyle or NothingEnum enumerator. Can also accept: String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeColor",
          "shortdesc": "The diagonal line color, specified as a swatch. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeTint",
          "shortdesc": "The diagonal line tint (as a percentage). (Range: 0 to 100). Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeOverprint",
          "shortdesc": "If true, the diagonal line stroke will overprint. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeGapColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the gap of the diagonal line stroke. Note: Not valid when diagonal line stroke type is solid. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeGapTint",
          "shortdesc": "The tint (as a percentage) of the diagonal line stroke gap color. Note: Not valid when diagonal line stroke type is solid. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "diagonalLineStrokeGapOverprint",
          "shortdesc": "If true, the stroke gap of the diagonal line will overprint. Note: Not valid when diagonal line stroke type is solid. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "clipContentToCell",
          "shortdesc": "If true, clips the cell's content to width and height of the cell. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "firstBaselineOffset",
          "shortdesc": "The distance between the baseline of the text and the top inset of the cell. Can return: FirstBaseline enumerator or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "verticalJustification",
          "shortdesc": "The vertical alignment of cell. Can return: VerticalJustification enumerator or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "paragraphSpacingLimit",
          "shortdesc": "The maximum space that can be added between paragraphs in a cell. Note: Valid only when vertical justification is justified. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "minimumFirstBaselineOffset",
          "shortdesc": "The space between the baseline of the text and the top inset of the frame or cell. Can return: Unit (0 - 8640 points) or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rotationAngle",
          "shortdesc": "The rotation angle (in degrees) of the cell, specified as one of the following values: 0, 90, 180, or 270. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeWeight",
          "shortdesc": "The stroke weight of the left edge border stroke. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeType",
          "shortdesc": "The stroke type of the left edge. Can return: StrokeStyle or NothingEnum enumerator. Can also accept: String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the left edge border stroke. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeTint",
          "shortdesc": "The tint (as a percentage) of the left edge border stroke. (Range: 0 to 100). Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeOverprint",
          "shortdesc": "If true, the left edge border stroke will overprint. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeGapColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the gap of the left edge border stroke. Note: Not valid when left edge stroke type is solid. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeGapTint",
          "shortdesc": "The tint (as a percentage) of the left edge border stroke gap color. (Range: 0 to 100) Note: Not valid when left edge stroke type is solid. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "leftEdgeStrokeGapOverprint",
          "shortdesc": "If true, the gap color of the left edge border stroke will overprint. Note: Not valid when left edge stroke type is solid. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeWeight",
          "shortdesc": "The stroke weight of the top edge border stroke. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeType",
          "shortdesc": "The stroke type of the top edge. Can return: StrokeStyle or NothingEnum enumerator. Can also accept: String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the top edge border stroke. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeTint",
          "shortdesc": "The tint (as a percentage) of the top edge border stroke. (Range: 0 to 100). Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeOverprint",
          "shortdesc": "If true, the top edge border stroke will overprint. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeGapColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the gap of the top edge border stroke. Note: Not valid when top edge stroke type is solid. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeGapTint",
          "shortdesc": "The tint (as a percentage) of the top edge border stroke gap color. (Range: 0 to 100) Note: Not valid when top edge stroke type is solid. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "topEdgeStrokeGapOverprint",
          "shortdesc": "If true, the gap color of the top edge border stroke will overprint. Note: Not valid when top edge stroke type is solid. . Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeWeight",
          "shortdesc": "The stroke weight of the right edge border stroke. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeType",
          "shortdesc": "The stroke type of the right edge. Can return: StrokeStyle or NothingEnum enumerator. Can also accept: String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeColor",
          "shortdesc": "The color, specified as a swatch, of the right edge border stroke. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeTint",
          "shortdesc": "The tint (as a percentage) of the right edge border stroke. (Range: 0 to 100). Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeOverprint",
          "shortdesc": "If true, the right edge border stroke will overprint. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeGapColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the gap of the right edge border stroke. Note: Not valid when right edge stroke type is solid. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeGapTint",
          "shortdesc": "The tint (as a percentage) of the right edge border stroke gap color. (Range: 0 to 100) Note: Not valid when right edge stroke type is solid. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "rightEdgeStrokeGapOverprint",
          "shortdesc": "If true, the gap color of the right edge border stroke will overprint. Note: Not valid when right edge stroke type is solid. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeWeight",
          "shortdesc": "The stroke weight of the bottom edge border stroke. Can return: Unit or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeType",
          "shortdesc": "The stroke type of the bottom edge. Can return: StrokeStyle or NothingEnum enumerator. Can also accept: String.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the bottom edge border stroke. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeTint",
          "shortdesc": "The tint (as a percentage) of the bottom edge border stroke. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeOverprint",
          "shortdesc": "If true, the bottom edge border stroke will overprint. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeGapColor",
          "shortdesc": "The swatch (color, gradient, tint, or mixed ink) applied to the gap of the bottom edge border stroke. Note: Not valid when bottom edge stroke type is solid. Can return: Swatch or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeGapTint",
          "shortdesc": "The tint (as a percentage) of the bottom edge border stroke gap color. (Range: 0 to 100) Note: Not valid when bottom edge stroke type is solid. Can return: Real or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "bottomEdgeStrokeGapOverprint",
          "shortdesc": "If true, the gap color of the bottom edge border stroke will overprint. Note: Not valid when bottom edge stroke type is solid. Can return: Boolean or NothingEnum enumerator.",
          "datatype": {
            "type": "Mixed"
          }
        },
        {
          "name": "name",
          "shortdesc": "The name of the style.",
          "datatype": {
            "type": "String"
          }
        },
        {
          "name": "label",
          "shortdesc": "A property that can be set to any string.",
          "datatype": {
            "type": "String"
          }
        },
        {
          "name": "properties",
          "shortdesc": "A property that allows setting of several properties at the same time.",
          "datatype": {
            "type": "Object"
          }
        }
      ],
      "method": [
        {
          "name": "remove",
          "shortdesc": "Deletes the style.",
          "parameters": [
            {
              "name": "replacingWith",
              "shortdesc": "The style to apply in place of the deleted style. ",
              "datatype": {
                "type": "CellStyle"
              },
              "optional": true
            }
          ]
        },
        {
          "name": "duplicate",
          "shortdesc": "Duplicates the CellStyle.",
          "datatype": {
            "type": "CellStyle"
          }
        },
        {
          "name": "move",
          "shortdesc": "Moves the style to the specified location.",
          "parameters": [
            {
              "name": "to",
              "shortdesc": "The location relative to the reference object or within the containing object.",
              "datatype": {
                "type": "LocationOptions"
              }
            },
            {
              "name": "reference",
              "shortdesc": "The reference object. Note: Required when the to parameter specifies before or after. Can accept: ParagraphStyle, ParagraphStyleGroup, CharacterStyle, CharacterStyleGroup, CellStyle, CellStyleGroup, TableStyle, TableStyleGroup, Document or Application. ",
              "datatype": {
                "type": "Mixed"
              },
              "optional": true
            }
          ],
          "datatype": {
            "type": "CellStyle"
          }
        },
        {
          "name": "insertLabel",
          "shortdesc": "Sets the label to the value associated with the specified key.",
          "parameters": [
            {
              "name": "key",
              "shortdesc": "The key.",
              "datatype": {
                "type": "String"
              }
            },
            {
              "name": "value",
              "shortdesc": "The value.",
              "datatype": {
                "type": "String"
              }
            }
          ]
        },
        {
          "name": "extractLabel",
          "shortdesc": "Gets the label value associated with the specified key.",
          "parameters": [
            {
              "name": "key",
              "shortdesc": "The key.",
              "datatype": {
                "type": "String"
              }
            }
          ],
          "datatype": {
            "type": "String"
          }
        },
        {
          "name": "toSource",
          "shortdesc": "Generates a string which, if executed, will return the CellStyle.",
          "datatype": {
            "type": "String"
          }
        },
        {
          "name": "getElements",
          "shortdesc": "Resolves the object specifier, creating an array of object references.",
          "datatype": {
            "type": "CellStyle",
            "array": true
          }
        },
        {
          "name": "toSpecifier",
          "shortdesc": "Retrieves the object specifier.",
          "datatype": {
            "type": "String"
          }
        },
        {
          "name": "addEventListener",
          "shortdesc": "Adds an event listener.",
          "parameters": [
            {
              "name": "eventType",
              "shortdesc": "The event type.",
              "datatype": {
                "type": "String"
              }
            },
            {
              "name": "handler",
              "shortdesc": "The event handler. Can accept: File or JavaScript Function.",
              "datatype": {
                "type": "Mixed"
              }
            },
            {
              "name": "captures",
              "optional": true,
              "shortdesc": "This parameter is obsolete. ",
              "datatype": {
                "type": "Boolean",
                "value": false
              }
            }
          ],
          "datatype": {
            "type": "EventListener"
          }
        },
        {
          "name": "removeEventListener",
          "shortdesc": "Removes the event listener.",
          "parameters": [
            {
              "name": "eventType",
              "shortdesc": "The registered event type.",
              "datatype": {
                "type": "String"
              }
            },
            {
              "name": "handler",
              "shortdesc": "The registered event handler. Can accept: File or JavaScript Function.",
              "datatype": {
                "type": "Mixed"
              }
            },
            {
              "name": "captures",
              "optional": true,
              "shortdesc": "This parameter is obsolete. ",
              "datatype": {
                "type": "Boolean",
                "value": false
              }
            }
          ],
          "datatype": {
            "type": "Boolean"
          }
        }
      ]
    }
  ]
}