{
    "name": "Preferences",
    "dynamic": true,
    "elements": {
        "class": {
            "properties": [],
            "methods": []
        },
        "constructors": {
            "methods": []
        },
        "instance": {
            "properties": [
                {
                    "name": "extraMetadata",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "A set of metadata properties to be displayed beneath a thumbnail icon.",
                    "longdesc": "Sets this style for a specific Content pane view. Does not change the related global preference, and the changes do not persist beyond the current view.\n\t\t\t\tAn array of up to four string values; the first value in the array sets the first line of additional metadata, the second value sets the second line, and so on. An array value of undefined turns off the display of metadata for that line. Allowed values are: author, bit-depth, color-mode, color-profile, copyright, date-created, date-modified, description, dimensions, document-creator, document-kind, exposure, file-size, focal-length, keywords, label, opening-application"
                },
                {
                    "name": "showName",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "Whether to show thumbnail name beneath thumbnail icons.",
                    "longdesc": "Sets this style for a specific Content pane view. Does not change the related global preference, and the changes do not persist beyond the current view.\n\t\t\t\tWhen true, the names of thumbnails are displayed beneath the icon in this view. When false, they are not. (This is overridden by the document.showThumbnailName value.)"
                },
                {
                    "name": "AccentColor",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the General page of the Preferences dialog, the preference associated with the AccentColor menu.",
                    "longdesc": "One of: System, Crystal, Obsidian, Sapphire, Lapis Lazuli, Amber, Ruby, Emerald.\n          "
                },
                {
                    "name": "AutoExportCaches",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the Cache page of the Preferences dialog, the preference associated with Cache choices.",
                    "longdesc": "True when Automatically Export Caches to Folders When Possible is selected. Default false.\n          "
                },
                {
                    "name": "CacheDirectory",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Cache page of the Preferences dialog, the preference associated with the Cache Location.",
                    "longdesc": "The location of the centralized cache. A folder path, specified as a string or ExtendScript Folder object.\n          "
                },
                {
                    "name": "Favorites",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "In the General page of the Preferences dialog, the preference associated with Favorite Items choices.",
                    "longdesc": "A collection of Bridge URI strings for checked nodes, which are displayed in the Favorites palette.\n          "
                },
                {
                    "name": "FavoritesDisplayNames",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "A collection of localized display names for the nodes displayed in the Favorites palette.",
                    "longdesc": "Each member corresponds to URI member of the Favorites array.\n          "
                },
                {
                    "name": "FileSize",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "In the Thumbnails page of the Preferences dialog, the preference associated with \"Do not process files larger than: nnn MB\".",
                    "longdesc": "Default 1000.\n          "
                },
                {
                    "name": "HideEmptyFields",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the Metadata page of the Preferences dialog, the preference associated with the \"Hide Empty Fields\" checkbox.",
                    "longdesc": "True when checked. Default true.\n          "
                },
                {
                    "name": "HideUnknownOpeners",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the File Type Associations page of the Preferences dialog, the preference associated with the \"Hide Undefined File Associations\" checkbox.",
                    "longdesc": "True when checked. Default false.\n          "
                },
                {
                    "name": "ImageBackdrop",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "In the General page of the Preferences dialog, the preference associated with the \"Image Backdrop\" slide bar.",
                    "longdesc": "Sets background of the Content pane.The background color is set in the range of 0 - 255, where 0 is black, and 255 is white. Default 186.\n          "
                },
                {
                    "name": "Keyboard",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Advanced page of the Preferences dialog, the preference associated with Keyboard.",
                    "longdesc": "Takes effect on restart.\n          "
                },
                {
                    "name": "Label1",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Labels page of the Preferences dialog, the preferences associated with the label colors and their keyboard shortcuts.",
                    "longdesc": "These preferences control the choices that appear in the Label menu in the menu bar and in the right-click context menu for image thumbnails.\n          "
                },
                {
                    "name": "Label2",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Labels page of the Preferences dialog, the preferences associated with the label colors and their keyboard shortcuts.",
                    "longdesc": "\n            These preferences control the choices that appear in the Label menu in the menu bar and in the right-click context menu for image thumbnails.\n          "
                },
                {
                    "name": "Label3",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Labels page of the Preferences dialog, the preferences associated with the label colors and their keyboard shortcuts.",
                    "longdesc": "\n            These preferences control the choices that appear in the Label menu in the menu bar and in the right-click context menu for image thumbnails.\n          "
                },
                {
                    "name": "Label4",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Labels page of the Preferences dialog, the preferences associated with the label colors and their keyboard shortcuts.",
                    "longdesc": "\n            These preferences control the choices that appear in the Label menu in the menu bar and in the right-click context menu for image thumbnails.\n          "
                },
                {
                    "name": "Label5",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Labels page of the Preferences dialog, the preferences associated with the label colors and their keyboard shortcuts.",
                    "longdesc": "\n            These preferences control the choices that appear in the Label menu in the menu bar and in the right-click context menu for image thumbnails.\n          "
                },
                {
                    "name": "LabelCtrlKey",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the Labels page of the Preferences dialog, the preference associated with the \"Require the Control Key to Apply Labels and Ratings\" checkbox.",
                    "longdesc": "True when checked. Default true.\n          "
                },
                {
                    "name": "Language",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "In the Advanced page of the Preferences dialog, the preference associated with Language.",
                    "longdesc": "\n          "
                },
                {
                    "name": "MRUCount",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "In the General page of the Preferences dialog, the preference associated with \"Number of Recent Items to Display\".",
                    "longdesc": "\n          "
                },
                {
                    "name": "MRUFolders",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "The set of absolute path strings for recently-visited folders, displayed when the MRUCount is greater than 0.",
                    "longdesc": "\n          "
                },
                {
                    "name": "PermittedStartupScripts",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "In the Startup Scripts the Preferences dialog, the script names associated with selected script checkboxes.",
                    "longdesc": "This is the set of scripts that load automatically on startup.\n          "
                },
                {
                    "name": "ShowCameraRawInterface",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the General page of the Preferences dialog, the preference associated with the \"Double-Click Edits Camera Raw Settings in Bridge\" checkbox.",
                    "longdesc": "True when checked. Default false.\n          "
                },
                {
                    "name": "ShowPlacard",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the Metadata page of the Preferences dialog, the preference associated with the \"Show Metadata Placard\" checkbox.",
                    "longdesc": "True when checked. Default is true.\n          "
                },
                {
                    "name": "ShowTooltips",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the Thumbnails page of the Preferences dialog, the preference associated with \"Show Tooltips\".",
                    "longdesc": "True when checked. Default is false.\n          "
                },
                {
                    "name": "StackFrameRate",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "In the Playback page of the Preferences dialog, the preference associated with \"Stack Playback Frame Rate\".\n          ",
                    "longdesc": "One of: 2, 4, 6, 10, 12, 15, 24, 25, 30, 50, 60.\n          "
                },
                {
                    "name": "StartupScriptsShouldLoad",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the Startup Scripts the Preferences dialog, setting to true is the equivalent of clicking Enable All, setting to false is the equivalent of clicking Disable All.",
                    "longdesc": "\n          "
                },
                {
                    "name": "ThumbnailQuality",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The quality of thumbnail image to generate.",
                    "longdesc": "One of: Draft: Quick Thumbnails, Proof: High Quality Thumbnails, DraftToProof: Convert To Hight Quality When Previewed"
                },
                {
                    "name": "UIBrightness",
                    "readonly": false,
                    "type": "Number",
                    "array": false,
                    "description": "In the General page of the Preferences dialog, the preference associated with the \"User Interface Brightness\" slide bar.",
                    "longdesc": "Sets background of all parts of the browser window except the Content pane. The background color is set in the range of [0..255], where 0 is black, and 255 is white.\n          "
                },
                {
                    "name": "UseSoftwareRendering",
                    "readonly": false,
                    "type": "Boolean",
                    "array": false,
                    "description": "In the Advanced page of the Preferences dialog, the preference associated with the \"Use Software Rendering\" checkbox.",
                    "longdesc": "True when checked. Takes effect on restart. When true, hardware acceleration is disabled for the Preview panel and slideshows. Default is false.\n          "
                }
            ],
            "methods": [
                {
                    "name": "clear",
                    "parameters": [
                        {
                            "name": "name",
                            "type": "Unspecified",
                            "array": false,
                            "optional": true,
                            "description": "One or more names of preferences to remove."
                        }
                    ],
                    "description": "Removes script-created keys and values from the Adobe Bridge preferences, or resets preferences. ",
                    "longdesc": "If one or more preference names is passed, each is removed. If you try to access the property for a preference that has been removed, the property returns undefined.If no preference names are passed, removes all script-defined preferences, and resets all Adobe Bridge application preferences to their default values."
                },
                {
                    "name": "resetWarningDialogs",
                    "parameters": [],
                    "description": "Resets \"Do not show again\" settings to false for all warning dialogs.",
                    "longdesc": " Corresponds to the Reset button in the General page of the Preferences dialog."
                },
                {
                    "name": "resetFileAssociations",
                    "parameters": [],
                    "description": "Resets file type associations to their default values. ",
                    "longdesc": "Corresponds to the \"Reset to Default Associatetions\" button in the File Type Associations page of the Preferences dialog."
                }
            ]
        }
    },
    "description": "Allows access to the Adobe Bridge application preferences. ",
    "longdesc": "The preference properties listed here are the static properties. Additional dynamic properties reflect the prefereences that can be viewed in and controlled by Preferences dialog. Some existing preferences can be set or read by setting or retrieving the associated property value. Not all existing preferences are available in the scripting environment. Those that are available are listed in the Adobe Bridge JavaScript Reference. Preference values do not take effect until Adobe Bridge application is restarted.\n\t\tYou can set certain preference values for the current session only. That is, the changes take effect immediately, but do not persist across sessions. The next time the Adobe Bridge application is restarted, the global preference value is used.\n\t\tA script can create a new preference by simply referencing a new property name in this object. New preferences must be of the type String, Number, or Boolean. Composite types (such as Rect and Point) are retrieved as String objects.\n\t\tAccess the Preferences object through the app.preferences property."
}