{
    "name": "TextPanelette",
    "dynamic": true,
    "elements": {
        "class": {
            "properties": [],
            "methods": []
        },
        "constructors": {
            "methods": []
        },
        "instance": {
            "properties": [
                {
                    "name": "keyValuePairs",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "A set of two-element arrays in the format [key, value]. ",
                    "longdesc": "The array corresponds to the thumbnails array, each pair describing the text for the corresponding thumbnail.The key is shown on the left of each field in bold, and the value on the right in plain text.The fields contains string literals combined with panelette markup elements, which specify the text to be displayed."
                },
                {
                    "name": "thumbnails",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "The nodes corresponding to the key-value pairs.",
                    "longdesc": "An array of Thumbnail objects or node URI strings for which to display descriptive text; or the special markup [[this]] to indicate the currently selected thumbnail in the Content pane."
                },
                {
                    "name": "titleMarkup",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "Localizable text shown in the subpanel header bar. ",
                    "longdesc": "Can include panelette markup elements. If not supplied, the name string appears as the  header."
                },
                {
                    "name": "name",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The unique, identifying name of this subpanel. "
                }
            ],
            "methods": []
        }
    },
    "description": "Represents a member subpanel of an InspectorPanel object that displays textual information about a set of thumbnails. ",
    "longdesc": " It differs from the ThumbnailPanelette object in that it does not display the thumbnail icon, only the related text.\nThe text can be static, or can be obtained dynamically from the associated thumbnail at display time, using panelette markup syntax. "
}