{
    "name": "ThumbnailPanelette",
    "dynamic": true,
    "elements": {
        "class": {
            "properties": [],
            "methods": []
        },
        "constructors": {
            "methods": []
        },
        "instance": {
            "properties": [
                {
                    "name": "keyValuePairs",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "A set of two-element arrays in the format [key, value]. ",
                    "longdesc": "The array corresponds to the thumbnails array, each pair describing the text for the corresponding thumbnail.The key is shown on the left of each field in bold, and the value on the right in plain text.The fields contains string literals combined with panelette markup elements, which specify the text to be displayed."
                },
                {
                    "name": "textPosition",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The placement of the displayed text in the horizontal presentation mode.",
                    "longdesc": "One of:\n\t\t\t\tbelow: (Default) Displays text below the thumbnail icon.\n\t\t\t\tright: Displays text to the right of the thumbnail icon."
                },
                {
                    "name": "thumbnails",
                    "readonly": false,
                    "type": "Array",
                    "array": false,
                    "description": "The nodes corresponding to the key-value pairs.",
                    "longdesc": "An array of Thumbnail objects or node URI strings for which to display descriptive text; or the special markup [[this]] to indicate the currently selected thumbnail in the Content pane."
                },
                {
                    "name": "titleMarkup",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "Localizable text shown in the subpanel header bar. ",
                    "longdesc": "Can include panelette markup elements. If not supplied, the name string appears as the  header."
                },
                {
                    "name": "name",
                    "readonly": false,
                    "type": "String",
                    "array": false,
                    "description": "The unique, identifying name of this subpanel. "
                }
            ],
            "methods": []
        }
    },
    "description": "Represents a member subpanel of an InspectorPanel object that displays resizeable thumbnail icons, with corresponding text labels for each thumbnail. ",
    "longdesc": "The text can be specified with literal strings, derived from data in various ways, or calculated using JavaScript, using panelette markup syntax.The displayed thumbnails are mouse-sensitive. A single click makes a thumbnail the inspection focus for the Inspector, and reveals or navigates to that thumbnail in the Content pane."
}